# c++14虚表，多基派生&虚拟继承

## 虚表

~~~c++
//深度探索 c++对象模型第 2，3，4章

//动态多态通过函数指针来体现

类创建对象的过程中产生一个虚函数指针，虚函数指针指向虚表，虚表中存放虚函数的入口地址；
派生类对象的地址解引用就得到虚表的入口地址；
虚表的入口地址再解引用就得到第一个虚函数的入口地址。

虚表中存储虚函数的入口地址，
一个类只有一张虚表；
~~~

### 虚表的存在

~~~c++
		栈区				虚表				程序代码区
   									  Derived::Derived()
   	vfptr	------>	 &Derived::f()	---> Derived::f()
	_base			 &Derived::g() ---> Deried::g()
    _derived		 &Derived::h()	--->  Derived::h()
    								  
~~~

### 验证虚表的存在

~~~c++
//虚表中打印出的第一个虚函数的地址和函数指针打印出的第一个虚函数地址相同，证明虚表存在。
//验证虚表有几张，再创建一个对象，打印其地址。
#include <iostream>

using std::cout;
using std::endl;

class Base
{
public:
    Base(long base = 0)
    : _base(base)
    {
        cout << "Base(long = 0)" << endl;
    }

    virtual
    void f()
    {
        cout << "void Base::f()" << endl;
    }

    virtual
    void g()
    {
        cout << "void Base::g()" << endl;
    }

    virtual
    void h()
    {
        cout << "void Base::h()" << endl;
    }

    ~Base()
    {
        cout << "~Base()" << endl;
    }

private:
    long _base;
};

class Derived
: public Base
{
public:
    Derived(long base = 0, long derived = 0)
    : Base(base)
    , _derived(derived)
    {
        cout << "Derived(long = 0, long = 0)" << endl;
    }

    virtual
    void f()
    {
        cout << "void Derived::f()" << endl;
    }

    virtual
    void g()
    {
        cout << "void Derived::g()" << endl;
    }

    virtual
    void h()
    {
        cout << "void Derived::h()" << endl;
    }


    ~Derived()
    {
        cout << "~Derived()" << endl;
    }
private:
    long _derived;
};

void test()
{
    //虚表是存在的,并且只读段,对于本例子而言，虚表只有一张
    //(对于普通的带虚函数的单继承而言，一个类只有一张虚表)
    Derived derived(10, 20);
    printf("派生类对象derived的地址 ： %p\n", &derived);
    printf("派生类对象derived的地址 ： %p\n", (long *)&derived);
    printf("虚表的地址 ： %p\n", (long *)*(long *)&derived);
    //虚表中打印出的第一个虚函数的地址
    printf("第一个虚函数的地址 ： %p\n", (long *) * (long *)*(long *)&derived);


    cout << endl << endl;
    typedef void (*pFunc)();
    pFunc func = (pFunc)*((long *)*(long *)&derived);
    func();
    //函数指针打印出的虚函数地址
    printf("第一个虚函数的地址 : %p\n", func);

    cout << endl;
    func  = (pFunc)*((long *)*(long *)&derived + 1);//偏移1个字节
    func();
    printf("第二个虚函数的地址 : %p\n", func);

    cout << endl;
    func = (pFunc)*((long *)*(long *)&derived + 2);//偏移2个地址
    func();
    printf("第三个虚函数的地址 : %p\n", func);

    cout << endl << endl;
    Derived derived2(100, 200);
    printf("派生类对象derived2的地址 ： %p\n", &derived2);
    //地址转为long类型的指针
    printf("派生类对象derived2的地址 ： %p\n", (long *)&derived2);
    printf("虚表的地址 ： %p\n", (long *)*(long *)&derived2);
    printf("第一个虚函数的地址 ： %p\n", (long *) * (long *)*(long *)&derived2);


    cout << endl << endl;
    cout << "derived对象的_base = " << (long)*((long *)&derived + 1) << endl;
    cout << "derived对象的_derived = " << (long)*((long *)&derived + 2) << endl;

}

int main(int argc, char **argv)
{
    test();
    return 0;
}

~~~

## 带虚函数的多基派生

~~~c++
1.每个基类都有自己的虚函数表
    
2.派生类如果有自己的虚函数，会被加入到第一个虚函数表之中
    
3.内存布局中，其基类的布局按照基类被声明时的顺序进行排列
    
4.派生类会覆盖基类的虚函数，只有第一个虚函数表中存放的是，真实的被覆盖的函数的地址；其它的虚函数表中存放的并不是真实的对应的虚函数的地址，而只是一条跳转指令。
~~~

### 测试代码

~~~c++
#include <iostream>

using std::cout;
using std::endl;

class Base1
{
public:
	Base1() : _iBase1(10) {}

	virtual void f()
	{
		cout << "Base1::f()" << endl;
	}

	virtual void g()
	{
		cout << "Base1::g()" << endl;
	}

	virtual void h()
	{
		cout << "Base1::h()" << endl;
	}
private:
	int _iBase1;
};

class Base2
{
public:
	Base2() : _iBase2(100) {}

	virtual void f()
	{
		cout << "Base2::f()" << endl;
	}

	virtual void g()
	{
		cout << "Base2::g()" << endl;
	}

	virtual void h()
	{
		cout << "Base2::h()" << endl;
	}
private:
	int _iBase2;
};

class Base3
{
public:
	Base3() : _iBase3(1000) {}

	virtual void f()
	{
		cout << "Base3::f()" << endl;
	}

	virtual void g()
	{
		cout << "Base3::g()" << endl;
	}

	virtual void h()
	{
		cout << "Base3::h()" << endl;
	}
private:
	int _iBase3;
};


class Derived
	: virtual public Base1
	, /*virtual*/ public Base2
	, /*virtual*/ public Base3
{
public:
	Derived() : _iDerived(10000) {}
	void f()
	{
		cout << "Derived::f()" << endl;
	}

	virtual void g1()
	{
		cout << "Derived::g1()" << endl;
	}

private:
	int _iDerived;
};

int main(void)
{
	Derived d;
	Base2* pBase2 = &d;
	Base3* pBase3 = &d;
	Derived* pDerived = &d;

	pBase2->f();
	cout << "sizeof(d) = " << sizeof(d) << endl;

	cout << "&Derived = " << &d << endl;   // 这三个地址值是不一样的
	cout << "pBase2 = " << pBase2 << endl; //
	cout << "pBase3 = " << pBase3 << endl; //

	return 0;
}
~~~

### 多基派生的二义性

~~~c++
#include <iostream>

using std::cout;
using std::endl;

class A
{
public:
    virtual
    void a()
    {
        cout << "A::a()" << endl;
    }

    virtual
    void b()
    {
        cout << "A::b()" << endl;
    }

    virtual
    void c()
    {
        cout << "A::c()" << endl;
    }
};

class B
{
public:
    virtual
    void a()
    {
        cout << "B::a()" << endl;
    }

    virtual
    void b()
    {
        cout << "B::b()" << endl;
    }

    void c()
    {
        cout << "B::c()" << endl;
    }

    void d()
    {
        cout << "B::d()" << endl;
    }
};

class C
: public A
, public B
{
public:
    virtual
    void a()
    {
        cout << "C::a()" << endl;
    }

    //虚函数
    void c()
    {
        cout << "C::c()" << endl;
    }

    void d()
    {
        cout << "C::d()" << endl;
    }

};

class D
: public C
{
public:
    void c()
    {
        cout << "D::c()" << endl;
    }

};
void test()
{
    cout << "sizeof(A) = " << sizeof(A) << endl;
    cout << "sizeof(B) = " << sizeof(B) << endl;
    cout << "sizeof(C) = " << sizeof(C) << endl << endl;
    C c;
    printf("&c : %p\n", &c);

    cout << endl;
    A *pa = &c;
    printf("pa : %p\n", pa);
    pa->a();
    pa->b();
    pa->c();

    cout << endl;
    B *pb = &c;
    printf("pb : %p\n", pb);
    pb->a();
    pb->b();
    pb->c();
    pb->d();

    cout << endl;
    C *pc = &c;
    printf("pc : %p\n", pc);
    pc->a();
    /* pc->b();//二义性 */
    pc->A::b();
    pc->B::b();
    pc->c();
    pc->d();//隐藏

    cout << endl;
    D d;
    pc = &d;
    pc->c();
}
int main(int argc, char **argv)
{
    test();
    return 0;
}


~~~

## 内存布局测试

~~~c++

// 测试一：单个虚继承，不带虚函数
//	虚继承与继承的区别
//	１.　多了一个虚基指针
//	２.　虚基类子对象位于派生类存储空间的最末尾(先存不变的后存共享的)


// 测试二：单个虚继承，带虚函数
//   1.如果派生类没有自己新的虚函数，此时派生类对象不会产生虚函数指针
//   2.如果派生类拥有自己新增的虚函数，此时派生类对象就会产生自己本身的虚函数指针(指向新增的虚函数)，
//     并且该虚函数指针位于派生类对象存储空间的开始位置
//

#pragma vtordisp(off)
#include <iostream>
using std::cout;
using std::endl;

class A
{
public:
	A() : _ia(10) {}

	virtual
	void f()
	{
		cout << "A::f()" << endl;
	}
private:
	int _ia;
};

class B
: virtual public A
{
public:
	B() : _ib(20) {}

	void fb()
	{
		cout << "A::fb()" << endl;
	}

	virtual 
	void f()
	{
		cout << "B::f()" << endl;
	}

	virtual 
	void fb2()
	{
		cout << "B::fb2()" << endl;
	}

private:
	int _ib;
};

int main(void)
{
	cout << sizeof(A) << endl;
	cout << sizeof(B) << endl;
	B b;
	return 0;
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门提示: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件

~~~



```c++

#pragma vtordisp(off)
#include <iostream>

// 测试三：多重继承（带虚函数）
// １、每个基类都有自己的虚函数表
// ２、派生类如果有自己新增的虚函数，会被加入到第一个虚函数表之中
// ３、内存布局中，　其基类的布局按照基类被继承时的顺序进行排列
// ４、派生类会覆盖基类的虚函数，只有第一个虚函数表中存放的是真实的被覆盖的虚函数的地址；
//     其它的虚函数表中存放的并不是真实的对应的虚函数的地址，而只是一条跳转指令

using std::cout;
using std::endl;

class Base1
{
public:
	Base1() : _iBase1(10) {}

	virtual void f()
	{
		cout << "Base1::f()" << endl;
	}

	virtual void g()
	{
		cout << "Base1::g()" << endl;
	}

	virtual void h()
	{
		cout << "Base1::h()" << endl;
	}
private:
	int _iBase1;
};

class Base2
{
public:
	Base2() : _iBase2(100) {}

	virtual void f()
	{
		cout << "Base2::f()" << endl;
	}

	virtual void g()
	{
		cout << "Base2::g()" << endl;
	}

	virtual void h()
	{
		cout << "Base2::h()" << endl;
	}
private:
	int _iBase2;
};

class Base3
{
public:
	Base3() : _iBase3(1000) {}

	virtual void f()
	{
		cout << "Base3::f()" << endl;
	}

	virtual void g()
	{
		cout << "Base3::g()" << endl;
	}

	virtual void h()
	{
		cout << "Base3::h()" << endl;
	}
private:
	int _iBase3;
};


class Derived
	: virtual public Base1
	, /*virtual*/ public Base2
	, /*virtual*/ public Base3
{
public:
	Derived() : _iDerived(10000) {}
	void f()
	{
		cout << "Derived::f()" << endl;
	}

	virtual void g1()
	{
		cout << "Derived::g1()" << endl;
	}

private:
	int _iDerived;
};

int main(void)
{
	Derived d;
	Base2* pBase2 = &d;
	Base3* pBase3 = &d;
	Derived* pDerived = &d;

	pBase2->f();
	cout << "sizeof(d) = " << sizeof(d) << endl;

	cout << "&Derived = " << &d << endl;   // 这三个地址值是不一样的
	cout << "pBase2 = " << pBase2 << endl; //
	cout << "pBase3 = " << pBase3 << endl; //

	return 0;
}
```





```c++

// 测试四：钻石型虚继承

//虚基指针所指向的虚基表的内容：
//	1. 虚基指针的第一条内容表示的是该虚基指针距离所在的子对象的首地址的偏移
//	2. 虚基指针的第二条内容表示的是该虚基指针距离虚基类子对象的首地址的偏移


#pragma vtordisp(off)
#include <iostream>
using std::cout;
using std::endl;

class B
{
public:
	B() : _ib(10), _cb('B') {}

	virtual void f()
	{
		cout << "B::f()" << endl;
	}

	virtual void Bf()
	{
		cout << "B::Bf()" << endl;
	}

private:
	int _ib;
	char _cb;
};

class B1 : virtual public B
{
public:
	B1() : _ib1(100), _cb1('1') {}

	virtual void f()
	{
		cout << "B1::f()" << endl;
	}

#if 1
	virtual void f1()
	{
		cout << "B1::f1()" << endl;
	}
	virtual void Bf1()
	{
		cout << "B1::Bf1()" << endl;
	}
#endif

private:
	int _ib1;
	char _cb1;
};

class B2 : virtual public B
{
public:
	B2() : _ib2(1000), _cb2('2') {}

	virtual void f()
	{
		cout << "B2::f()" << endl;
	}
#if 1
	virtual void f2()
	{
		cout << "B2::f2()" << endl;
	}

	virtual void Bf2()
	{
		cout << "B2::Bf2()" << endl;
	}
#endif
private:
	int _ib2;
	char _cb2;
};

class D : public B1, public B2
{
public:
	D() : _id(10000), _cd('3') {}

	virtual void f()
	{
		cout << "D::f()" << endl;
	}

#if 1
	virtual void f1()
	{
		cout << "D::f1()" << endl;
	}

	virtual void f2()
	{
		cout << "D::f2()" << endl;
	}

	virtual void Df()
	{
		cout << "D::Df()" << endl;
	}
#endif
private:
	int _id;
	char _cd;
};

int main(void)
{
	D d;
	cout << sizeof(d) << endl;

	return 0;
}
```

### 测试结果分析

```c++
以下测试都是基于VS，X86环境(32bit)。。

注意：虚基指针指向虚基类，虚函数指针指向虚表。。
Linux与vs的唯一区别是，在Linux下虚函数指针与虚基指针合并了

项目->(右键)属性->配置属性->C/C++->命令行
/d1 reportSingleClassLayoutXXX 或者/d1 reportAllClassLayout


测试一、虚继承与继承的区别
//	１.　多了一个虚基指针
//	２.　虚基类子对象位于派生类存储空间的最末尾(先存不变的后存共享的)

1.1、单个继承，不带虚函数
4/8
1>class B	size(8):
1>	+---
1> 0	| +--- (base class A)
1> 0	| | _ia
1>	| +---
1> 4	| _ib


1.2、单个虚继承，不带虚函数
4/12
1>class B	size(12):
1>	+---
1> 0	| {vbptr}
1> 4	| _ib
1>	+---
1>	+--- (virtual base A)
1> 8	| _ia
1>	+---
1>B::$vbtable@:
1> 0	| 0
1> 1	| 8 (Bd(B+0)A)


测试二：单个虚继承，带虚函数
//   1.如果派生类没有自己新增的虚函数，此时派生类对象不会产生虚函数指针
//   2.如果派生类拥有自己新增的虚函数，此时派生类对象就会产生自己本身的
//    虚函数指针(指向新增的虚函数)，并且该虚函数指针位于派生类对象存储空间的开始位置
2.1、单个继承，带虚函数
8/12
1>class B	size(12):
1>	+---
1> 0	| +--- (base class A)
1> 0	| | {vfptr}
1> 4	| | _ia
1>	| +---
1> 8	| _ib
1>	+---
1>B::$vftable@:
1>	| &B_meta
1>	|  0
1> 0	| &B::f


2.2、单个继承，带虚函数(自己新增虚函数)
8/12
>class B	size(12):
1>	+---
1> 0	| +--- (base class A)
1> 0	| | {vfptr}
1> 4	| | _ia
1>	| +---
1> 8	| _ib
1>	+---
1>B::$vftable@:
1>	| &B_meta
1>	|  0
1> 0	| &B::f
1> 1	| &B::fb2
总结：针对2.1、2.2，普通继承，派生类新增虚函数直接放在基类虚表中；且基类布局在前面


2.3、单个虚继承，带虚函数
8/16
1>class B	size(16):
1>	+---
1> 0	| {vbptr}    //有虚继承的时候就多一个虚基指针，虚基指针指向虚基表  
1> 4	| _ib        //有虚函数的时候就产生一个虚函数指针，虚函数指针指向虚函数表
1>	+--- 
1>	+--- (virtual base A)
1> 8	| {vfptr}
1>12	| _ia
1>	+---
1>B::$vbtable@:
1> 0	| 0
1> 1	| 8 (Bd(B+0)A)
1>B::$vftable@:
1>	| -8
1> 0	| &B::f


2.4、单个虚继承，带虚函数(自己新增虚函数)
8/20
1>class B	size(20):
1>	+---
1> 0	| {vfptr}
1> 4	| {vbptr}
1> 8	| _ib
1>	+---
1>	+--- (virtual base A)
1>12	| {vfptr}
1>16	| _ia
1>	+---
1>B::$vftable@B@:
1>	| &B_meta
1>	|  0
1> 0	| &B::fb2
1>B::$vbtable@:
1> 0	| -4
1> 1	| 8 (Bd(B+4)A)
1>B::$vftable@A@:
1>	| -12
1> 0	| &B::f
总结：2.3、2.4、虚继承多一个虚基指针，如果派生类新增虚函数，则放在最前面；且基类布局放在最后面


// 测试三：多重继承（带虚函数）
// １、每个基类都有自己的虚函数表
// ２、派生类如果有自己新增的虚函数，会被加入到第一个虚函数表之中
// ３、内存布局中,其基类的布局按照基类被继承时的顺序进行排列
// ４、派生类会覆盖基类的虚函数，只有第一个虚函数表中存放的是真实的被覆盖的虚函数的地址；
//     其它的虚函数表中存放的并不是真实的对应的虚函数的地址，而只是一条跳转指令

3.1、普通多重继承，带虚函数，自己有新增虚函数
28
1>class Derived	size(28):
1>	+---
1> 0	| +--- (base class Base1)
1> 0	| | {vfptr}
1> 4	| | _iBase1
1>	| +---
1> 8	| +--- (base class Base2)
1> 8	| | {vfptr}
1>12	| | _iBase2
1>	| +---
1>16	| +--- (base class Base3)
1>16	| | {vfptr}
1>20	| | _iBase3
1>	| +---
1>24	| _iDerived
1>	+---
1>Derived::$vftable@Base1@:
1>	| &Derived_meta
1>	|  0
1> 0	| &Derived::f(虚函数的覆盖)
1> 1	| &Base1::g
1> 2	| &Base1::h
1> 3	| &Derived::g1(新的虚函数，直接放在基类之后，加快查找速度)
1>Derived::$vftable@Base2@:
1>	| -8
1> 0	| &thunk: this-=8; goto Derived::f   //虚函数表还可以存放跳转指令
1> 1	| &Base2::g
1> 2	| &Base2::h
1>Derived::$vftable@Base3@:
1>	| -16
1> 0	| &thunk: this-=16; goto Derived::f
1> 1	| &Base3::g
1> 2	| &Base3::h


3.2、虚拟多重继承，带虚函数，自己有新增虚函数(只有第一个是虚继承)
32
1>class Derived	size(32):
1>	+---
1> 0	| +--- (base class Base2)
1> 0	| | {vfptr}
1> 4	| | _iBase2
1>	| +---
1> 8	| +--- (base class Base3)
1> 8	| | {vfptr}
1>12	| | _iBase3
1>	| +---
1>16	| {vbptr}
1>20	| _iDerived
1>	+---
1>	+--- (virtual base Base1)
1>24	| {vfptr}
1>28	| _iBase1
1>	+---
1>Derived::$vftable@Base2@:
1>	| &Derived_meta
1>	|  0
1> 0	| &Derived::f
1> 1	| &Base2::g
1> 2	| &Base2::h
1> 3	| &Derived::g1
1>Derived::$vftable@Base3@:
1>	| -8
1> 0	| &thunk: this-=8; goto Derived::f
1> 1	| &Base3::g
1> 2	| &Base3::h
1>Derived::$vbtable@:
1> 0	| -16
1> 1	| 8 (Derivedd(Derived+16)Base1)
1>Derived::$vftable@Base1@:
1>	| -24
1> 0	| &thunk: this-=24; goto Derived::f
1> 1	| &Base1::g
1> 2	| &Base1::h


3.3、虚拟多重继承，带虚函数，自己有新增虚函数(三个都是虚继承)
36
1>class Derived	size(36):
1>	+---
1> 0	| {vfptr}   //以空间换时间
1> 4	| {vbptr}
1> 8	| _iDerived
1>	+---
1>	+--- (virtual base Base1)
1>12	| {vfptr}
1>16	| _iBase1
1>	+---
1>	+--- (virtual base Base2)
1>20	| {vfptr}
1>24	| _iBase2
1>	+---
1>	+--- (virtual base Base3)
1>28	| {vfptr}
1>32	| _iBase3
1>	+---
1>Derived::$vftable@Derived@:
1>	| &Derived_meta
1>	|  0
1> 0	| &Derived::g1
1>Derived::$vbtable@:
1> 0	| -4
1> 1	| 8 (Derivedd(Derived+4)Base1)
1> 2	| 16 (Derivedd(Derived+4)Base2)
1> 3	| 24 (Derivedd(Derived+4)Base3)
1>Derived::$vftable@Base1@:
1>	| -12
1> 0	| &Derived::f
1> 1	| &Base1::g
1> 2	| &Base1::h
1>Derived::$vftable@Base2@:
1>	| -20
1> 0	| &thunk: this-=8; goto Derived::f
1> 1	| &Base2::g
1> 2	| &Base2::h
1>Derived::$vftable@Base3@:
1>	| -28
1> 0	| &thunk: this-=16; goto Derived::f
1> 1	| &Base3::g
1> 2	| &Base3::h


// 测试四：菱形虚继承

//虚基指针所指向的虚基表的内容：
//	1. 虚基指针的第一条内容表示的是该虚基指针距离所在的子对象的首地址的偏移
//	2. 虚基指针的第二条内容表示的是该虚基指针距离虚基类子对象的首地址的偏移
4.1、菱形普通继承(存储二义性)
48
class D	size(48):
1>	+---
1> 0	| +--- (base class B1)
1> 0	| | +--- (base class B)
1> 0	| | | {vfptr}
1> 4	| | | _ib
1> 8	| | | _cb  //1
1>  	| | | <alignment member> (size=3) //内存对齐
1>	| | +---
1>12	| | _ib1
1>16	| | _cb1
1>  	| | <alignment member> (size=3)
1>	| +---
1>20	| +--- (base class B2)
1>20	| | +--- (base class B)
1>20	| | | {vfptr}
1>24	| | | _ib
1>28	| | | _cb
1>  	| | | <alignment member> (size=3)
1>	| | +---
1>32	| | _ib2
1>36	| | _cb2
1>  	| | <alignment member> (size=3)
1>	| +---
1>40	| _id
1>44	| _cd
1>  	| <alignment member> (size=3)
1>	+---
1>D::$vftable@B1@:
1>	| &D_meta
1>	|  0
1> 0	| &D::f
1> 1	| &B::Bf
1> 2	| &D::f1
1> 3	| &B1::Bf1
1> 4	| &D::Df
1>D::$vftable@B2@:
1>	| -20
1> 0	| &thunk: this-=20; goto D::f
1> 1	| &B::Bf
1> 2	| &D::f2
1> 3	| &B2::Bf2

4.2、菱形虚拟继承
52
1>class D	size(52):
1>	+---
1> 0	| +--- (base class B1)
1> 0	| | {vfptr}
1> 4	| | {vbptr}
1> 8	| | _ib1
1>12	| | _cb1
1>  	| | <alignment member> (size=3)
1>	| +---
1>16	| +--- (base class B2)
1>16	| | {vfptr}
1>20	| | {vbptr}
1>24	| | _ib2
1>28	| | _cb2
1>  	| | <alignment member> (size=3)
1>	| +---
1>32	| _id
1>36	| _cd
1>  	| <alignment member> (size=3)
1>	+---
1>	+--- (virtual base B)
1>40	| {vfptr}
1>44	| _ib
1>48	| _cb
1>  	| <alignment member> (size=3)
1>	+---
1>D::$vftable@B1@:
1>	| &D_meta
1>	|  0
1> 0	| &D::f1
1> 1	| &B1::Bf1
1> 2	| &D::Df
1>D::$vftable@B2@:
1>	| -16
1> 0	| &D::f2
1> 1	| &B2::Bf2
1>D::$vbtable@B1@:
1> 0	| -4
1> 1	| 36 (Dd(B1+4)B)
1>D::$vbtable@B2@:
1> 0	| -4
1> 1	| 20 (Dd(B2+4)B)
1>D::$vftable@B@:
1>	| -40
1> 0	| &D::f
1> 1	| &B::Bf

```



## 虚拟继承

~~~c++
1.定义：
	即被virtual所修饰的事物或现象在本质上是存在的，但是没有直观的形式表现，无法直接描述或定义，需要通过其他的间接方式或手段才能够体现出其实际上的效果。
	关键就在于存在、间接和共享这三种特征：
		1.)虚函数是存在的
		2.)虚函数必须要通过一种间接的运行时（而不是编译时）机制才能够激活（调用）的函数
		3.)共享性表现在基类会共享被派生类重定义后的虚函数

2.虚拟继承是如何表现这三种特征的呢？
    1.)存在即表示虚继承体系和虚基类确实存在;
	2.)间接性表现在当访问虚基类的成员时同样也必须通过某种间接机制来完成（通过虚基表来完成）;
	3.)共享性表现在虚基类会在虚继承体系中被共享，而不会出现多份拷贝.
        
3.虚拟继承是指在继承定义中包含了virtual关键字的继承关系。虚基类是指在虚继承体系中的通过virtual继承而来的基类。
语法格式如下：
class Baseclass;
class Subclass
: public/private/protected virtual Baseclass
{
public:
	//...
private:
	//...
protected:
	//...
};
//其中Baseclass称之为Subclass的虚基类, 而不是说Baseclass就是虚基类
~~~

### 测试代码

~~~c++

// 结论一：单个虚继承，不带虚函数
//	虚继承与继承的区别
//	１.　多了一个虚基指针
//	２.　虚基类子对象位于派生类存储空间的最末尾(先存不变的后存共享的)


// 结论二：单个虚继承，带虚函数
//   1.如果派生类没有自己新的虚函数，此时派生类对象不会产生虚函数指针
//   2.如果派生类拥有自己新增的虚函数，此时派生类对象就会产生自己本身的虚函数指针(指向新增的虚函数)，
//     并且该虚函数指针位于派生类对象存储空间的开始位置
//

#pragma vtordisp(off)
#include <iostream>
using std::cout;
using std::endl;

class A
{
public:
	A() : _ia(10) {}

	virtual
	void f()
	{
		cout << "A::f()" << endl;
	}
private:
	int _ia;
};

class B
: virtual public A
{
public:
	B() : _ib(20) {}

	void fb()
	{
		cout << "A::fb()" << endl;
	}

	virtual 
	void f()
	{
		cout << "B::f()" << endl;
	}

	virtual 
	void fb2()
	{
		cout << "B::fb2()" << endl;
	}

private:
	int _ib;
};

int main(void)
{
	cout << sizeof(A) << endl;
	cout << sizeof(B) << endl;
	B b;
	return 0;
}

~~~



### 虚拟继承时派生类对象的构造与析构

~~~c++
1.在普通的继承体系中，比如A派生出B，B派生出C，则创建C对象时，
2.在C类构造函数的初始化列表中调用B类构造函数，然后在B类构造函数初始化列表中调用A类的构造函数，即可完成对象的创建操作。
3.但在虚拟继承中，则有所不同。
~~~



#### 示例代码

~~~c++
#include <iostream>

using std::cout;
using std::endl;

class A
{
public:
    A()
    {
        cout << "A()" << endl;
    }

    A(int ia)
    : _ia(ia)
    {
        cout << "A(int)" << endl;
    }

    ~A()
    {
        cout << "~A()" << endl;
    }
protected:
    int _ia;
};

class B
: virtual public A
{
public:
    B()
    {
        cout << "B()" << endl;
    }

    B(int ia, int ib)
    /* : A(ia) */
    : _ib(ib)
    {
        cout << "B(int, int)" << endl;
    }

    ~B()
    {
        cout << "~B()" << endl;
    }
protected:
    int _ib;
};

class C
: public B
{
public:
    C(int ia, int ib, int ic)
    : B(ia, ib)
    , A(ia)   //虚基类只能交给最终的派生类去初始化
    , _ic(ic)
    {
        cout << "C(int, int, int)" << endl;
    }

    void print()
    {
        cout << "_ia = " << _ia << endl
             << "_ib = " << _ib << endl
             << "_ic = " << _ic << endl;
    }

    ~C()
    {
        cout << "~C()" << endl;
    }
protected:
    int _ic;
};
int main(int argc, char **argv)
{
    C c(1, 2, 3);
    c.print();
    return 0;
}

~~~

#### 结果分析

~~~c++
1.在 C++ 中，如果继承链上存在虚继承的基类，则最底层的子类要负责完成该虚基类部分成员的构造。

2.即我们需要显式调用虚基类的构造函数来完成初始化，如果不显式调用，则编译器会调用虚基类的缺省构造函数，不管初始化列表中次序如何，对虚基类构造函数的调用总是先于普通基类的构造函数。

3.如果虚基类中没有定义的缺省构造函数，则会编译错误。因为如果不这样做，虚基类部分会在存在的多个继承链上被多次初始化。

4.很多时候，对于继承链上的中间类，我们也会在其构造函数中显式调用虚基类的构造函数，因为一旦有人要创建这些中间类的对象，我们要保证它们能够得到正确的初始化。这种情况在菱形继承中非常明显，
~~~



### 菱形继承

~~~c++
虚基指针所指向的虚基表的内容
1. 虚基指针的第一条内容表示的是该虚基指针距离所在的子对象的首地址的偏移;
2. 虚基指针的第二条内容表示的是该虚基指针距离虚基类子对象的首地址的偏移.
~~~

#### 示例代码

~~~c++
#include <iostream>
using std::cout;
using std::endl;
class B
{
public:
    B()
        : _ib(10), _cb('B')
    {
        cout << "B()" << endl;
    }
    B(int ib, char cb)
        : _ib(ib), _cb(cb)
    {
        cout << "B(int,char)" << endl;
    }
    virtual void f()
    {
        cout << "B::f()" << endl;
    }
    virtual void Bf()
    {
        cout << "B::Bf()" << endl;
    }

private:
    int _ib;
    char _cb;
};
class B1
    : virtual public B
{
public:
    B1()
        : _ib1(100), _cb1('1')
    {
    }
    B1(int ib, char ic, int ib1, char cb1)
        : B(ib, ic), _ib1(ib1), _cb1(cb1)
    {
        cout << "B1(int,char,int,char)" << endl;
    }
    virtual void f()
    {
        cout << "B1::f()" << endl;
    }
    virtual void f1()
    {
        cout << "B1::f1()" << endl;
    }

    virtual void Bf1()
    {
        cout << "B1::Bf1()" << endl;
    }

private:
    int _ib1;
    char _cb1;
};

class B2
    : virtual public B
{
public:
    B2()
        : _ib2(1000), _cb2('2')
    {
    }
    B2(int ib, char ic, int ib2, char cb2)
        : B(ib, ic), _ib2(ib2), _cb2(cb2)
    {
        cout << "B2(int,char,int,char)" << endl;
    }
    //virtual
    void f()
    {
        cout << "B2::f()" << endl;
    }
    //virtual
    void f2()
    {
        cout << "B2::f2()" << endl;
    }
    //virtual
    void Bf2()
    {
        cout << "B2::Bf2()" << endl;
    }

private:
    int _ib2;
    char _cb2;
};
class D
    : public B1
    ,public B2
{
public:
    D()
        : _id(10000), _cd('3')
    {
    }

    D(int ib, char cb, int ib1, char cb1, int ib2, char cb2, int id, char cd)
        : B1(ib1, cb1,id,cd)
        , B2(ib2, cb2,id,cd)
        , B(ib, cb)
        , _id(id)
        , _cd(cd)
    {
        cout << "D(...)" << endl;
    }
    virtual void f()
    {
        cout << "D::f()" << endl;
    }
    virtual void f1()
    {
        cout << "D::f1()" << endl;
    }
    virtual void f2()
    {
        cout << "D::f2()" << endl;
    }
    virtual void Df()
    {
        cout << "D::Df()" << endl;
    }

private:
    int _id;
    char _cd;
};

int main(void)
{
    D d;
    cout << sizeof(d) << endl;
    B1 *pb1 = &d;
    pb1->f();
    B2 *pb2 = &d;
    pb2->f();
    d.f();
    return 0;
}

~~~

#### 结果分析

~~~c++
1.如果是在若干类层次中，从虚基类直接或间接派生出来的派生类的构造函数初始化列表均有对该虚基类构造函数的调用，
2.那么创建一个派生类对象的时候只有该派生类列出的虚基类的构造函数被调用，
3.其他类列出的将被忽略，这样就保证虚基类的唯一副本只被初始化一次。
4.即虚基类的构造函数只被执行一次。

5.对于虚继承的派生类对象的析构，析构函数的调用顺序为：
	.先调用派生类的析构函数；
	.然后调用派生类中成员对象的析构函数；
	.再调用普通基类的析构函数；
	.最后调用虚基类 的析构函数。
~~~

## 效率分析

~~~
多重继承和虚拟继承对象模型较单一继承复杂的对象模型，造成了成员访问低效率，表现在两个方面：对象构造时vptr的多次设定，以及this指针的调整。
对于多种继承情况的效率比较如下：
~~~

| 继承情况 | vptr是否设定 | 数据成员访问               | 虚函数访问                                                   | 效率     |
| -------- | ------------ | -------------------------- | ------------------------------------------------------------ | -------- |
| 单一继承 | 无           | 指针/对象/引用访问效率相同 | 直接访问                                                     | 效率最高 |
| 单一继承 | 一次         | 指针/对象/引用访问效率相同 | 通过vptr和vtable访问                                         |          |
| 多重继承 | 多次         | 指针/对象/引用访问效率相同 | 通过vptr和vtable访问;通过第二或后继Base类指针访问，需要调整this指针 |          |
| 虚拟继承 | 多次         | 指针/对象/引用访问效率降低 | 通过vptr和vtable访问；访问虚类需要调整this指针               |          |

~~~c++
1. 多态的引入，带来了设定vptr和间接访问虚函数等效率的降低；
2.除了单一继承效率降低的情形，调整this指针也带来了效率的降低；
3.除了单一继承效率降低的情形，调整this指针也带来了效率的降低。
~~~

